Catalogs/Э_Лиды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Э_Лиды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IP_Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMAIL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветсвенныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Э_СтатусыЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭ_ДатаПоследнегоЗапланированногоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_Регистратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Э_CustomerID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ДатаПереходаВКлиента</Name>
					<Comment>Э_Волощук (21.12.2016)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ВыгружатьВБДВиртуальнойАТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Э_Лиды/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	//Э_Гашук(14.05.2015 www.nct.ua 
	//ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	//Э_Гашук) 
	//Э_Нарадько(2014.11.11	
	////Э_Нарадько(2014.10.31
	//Если Объект.Закрыт Тогда
	//	Удалить_Э_ЗаполнитьПартнера();
	//КонецЕсли;	
	////Э_Нарадько)
	//Э_Нарадько)
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Если ЗначениеЗаполнено(Объект.ИННПлательщикаНДС) Тогда
	//	ВыборкаКонтрагент = ПартнерыИКонтрагенты.ИННУжеИспользуетсяВИнформационнойБазе(Объект.ИННПлательщикаНДС,Объект.Ссылка);
	//	Если ВыборкаКонтрагент <> Неопределено Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Данные ИНН уже указаны для контрагента с кодом %1, ответственный - %2.'"),ВыборкаКонтрагент.Код,ВыборкаКонтрагент.ОсновнойМенеджер),
	//		,"Объект.ИННПлательщикаНДС",,);
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеДоступностью();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УправлениеДоступностью();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЦЫ ФОРМЫ КОНТАКТНАЯ ИНФОРМАЦИЯ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УправлениеДоступностью()
	
	//ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ФизЛицо","Доступность",(Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") ИЛИ Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель")));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	//Э_Гашук(14.05.2015 www.nct.ua 
	//УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	//Э_Гашук)
КонецПроцедуры

//&НаСервере
//Процедура Удалить_Э_ЗаполнитьПартнера()
//	//Э_Нарадько(2014.10.31
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Лид", Объект.Ссылка);
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Партнеры.Ссылка
//	|ИЗ
//	|	Справочник.Контрагенты КАК Партнеры
//	|ГДЕ
//	|	Партнеры.Э_Лид = &Лид";
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Если Выборка.Следующий() Тогда
//		Партнер = Выборка.Ссылка;
//	КонецЕсли;
//	
//	//Э_Нарадько)
//КонецПроцедуры


&НаКлиенте
Процедура НомерТелефонаПриИзменении(Элемент)
	Объект.НомерТелефона = Э_ТелефонияBinotel.Э_ПреобразоватьНомерТелефонаБезРазделителей(Объект.НомерТелефона);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЭ_СоздатьПартнера(Команда)
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		Отказ=Ложь;
		ТекстОшибки = НСтр("ru='Контрагент уже создан на основании данного лида';uk='Контрагент вже створений на підставі даного ліда'");   
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки,Отказ);
				
		Если Отказ Тогда
		    Возврат;
		КонецЕсли;	
	КонецЕсли;
	ПараметрФормы = Новый Структура(
		"Основание",
		Новый Структура("Наименование, Адрес, Объект, АдресЭП, АдресДоставки",
		                Объект.КонтактноеЛицо, Объект.НомерТелефона, Объект.Ссылка, Объект.EMAIL, Объект.Адрес)
	);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", ПараметрФормы,);
КонецПроцедуры

&НаСервере
Процедура ПартнерПриИзмененииНаСервере()
	Э_ТекОбъект=РеквизитФормыВЗначение("Объект");
	Э_ТекОбъект.Э_ОпределитьРеквизитЗакрыт();
	ЗначениеВРеквизитФормы(Э_ТекОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
    ПартнерПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборПартнераНайдено" И Параметр.Свойство("Партнер") Тогда
		
		Объект.Партнер=Параметр.Партнер;
		ПартнерПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница=Элементы.ГруппаСобытия Тогда
	    ЭлементОтбора = Э_СписокСобытийПоЛиду.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Э_Лид");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Ссылка;		
	КонецЕсли;
КонецПроцедуры
